app/Controllers/Seller/SellerController.php

    public function manage_profile(){
        $data['title'] = 'Profile Information';
        $user_id = session()->get('id');
        $userModel = new UsersModel();
        $countryModel = new Country();
        $data['user_data'] = $userModel->where('id', $user_id)->findAll();
        $data['country_data'] = $countryModel->findAll();
---
SELECT *
FROM `users`
WHERE `id` = '6'
SELECT *
FROM `tbl_countries`