app/Controllers/HomepageController.php

SELECT *
FROM `categories`
---
    public function index()
    {

        $postAddModel = new PostAdsModel();
        $data['highlightplans_ads'] = $postAddModel->get_highlight_post();

        $PostGalleryModel = new PostGalleryModel();
        $categoryMoldel = new CategoryModel();
        $data['adds_list_random'] = $postAddModel->get_random_post();
        $data['categorydetails'] = $categoryMoldel->findAll();