app/Controllers/Home.php

    public function register()
    {
        $CountryModel = new Country();
        $data['country'] = $CountryModel->findAll();
---
SELECT *
FROM `tbl_countries`

            ];
            // var_dump($this->request->getPost());
            // exit();
            $userModel->save($data);
---
INSERT INTO `users` (`country_pre`, `phone`, `country`, `email`, `password`, `created_at`, `updated_at`) VALUES ('Soluta nisi laborios', '651111111111', '84', 'mojaluci@mailinator.com', '$2y$10$25.EttBLeJxNyixyNIzHa.s35gSfdCmcpacCq1JKNofCjkoz99oqW', '2023-02-04 08:29:18', '2023-02-04 08:29:18')

        }else{
            $data['validation'] = $this->validator;
            $CountryModel = new Country();
            $data['country'] = $CountryModel->findAll();
---
SELECT *
FROM `tbl_countries`

    public function loginAuth()
    {
        $session = session();
        $userModel = new UsersModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'mawu@mailinator.com'
 LIMIT 1