app/Models/OrderModel.php

	public function get_ordersbyseller_id($userid,$searchText){


		$data=$this->db->table('tblorders')
				->select('tblorders.*,pa.title,pa.currency,c.name as category,ci.name as city,gpa.image_name,u.first_name,u.last_name,spc.name as membership')
				->join('post_ads pa','pa.id=tblorders.product_id','LEFT')
				->join('categories c','c.id=pa.category_id','LEFT')
				->join('cities ci','ci.id=pa.city_list','LEFT')
				->join('gallerypost_ads gpa','pa.id=gpa.post_id','LEFT')
				->join('users u','tblorders.user_id=u.id','LEFT')
				->join('subscription_plans spl','spl.id=pa.ad_plan_id','LEFT')
				->join('subscription_category spc','spc.id=spl.plan_id','LEFT')
				->where(['pa.seller_id'=>$userid]);

				if(!empty($searchText)){
					$data->where('pa.title LIKE "%'.$searchText.'%"');
				}
				$data=$data->orderby('tblorders.id','DESC')
				->groupBy('tblorders.id')
				 ->get()
				->getResultArray();
---
SELECT `tblorders`.*, `pa`.`title`, `pa`.`currency`, `c`.`name` as `category`, `ci`.`name` as `city`, `gpa`.`image_name`, `u`.`first_name`, `u`.`last_name`, `spc`.`name` as `membership`
FROM `tblorders`
LEFT JOIN `post_ads` `pa` ON `pa`.`id`=`tblorders`.`product_id`
LEFT JOIN `categories` `c` ON `c`.`id`=`pa`.`category_id`
LEFT JOIN `cities` `ci` ON `ci`.`id`=`pa`.`city_list`
LEFT JOIN `gallerypost_ads` `gpa` ON `pa`.`id`=`gpa`.`post_id`
LEFT JOIN `users` `u` ON `tblorders`.`user_id`=`u`.`id`
LEFT JOIN `subscription_plans` `spl` ON `spl`.`id`=`pa`.`ad_plan_id`
LEFT JOIN `subscription_category` `spc` ON `spc`.`id`=`spl`.`plan_id`
WHERE `pa`.`seller_id` = '6'
GROUP BY `tblorders`.`id`
ORDER BY `tblorders`.`id` DESC

	public function get_allsellerorders($userid,$fromdate,$todate,$type){

		$data=$this->db->table('tblorders')
				->select('tblorders.*,pa.title,pa.currency,c.name as category,ci.name as city,gpa.image_name,u.first_name,u.last_name,spc.name as membership')
				->join('post_ads pa','pa.id=tblorders.product_id','LEFT')
				->join('categories c','c.id=pa.category_id','LEFT')
				->join('cities ci','ci.id=pa.city_list','LEFT')
				->join('gallerypost_ads gpa','pa.id=gpa.post_id','LEFT')
				->join('users u','tblorders.user_id=u.id','LEFT')
				->join('subscription_plans spl','spl.id=pa.ad_plan_id','LEFT')
				->join('subscription_category spc','spc.id=spl.plan_id','LEFT')
				->where(['pa.seller_id'=>$userid]);

				if(!empty($fromdate) && !empty($todate)){
					$data->where('DATE_FORMAT(FROM_UNIXTIME(tblorders.order_at),"%Y-%m-%d") BETWEEN "'.$fromdate.'" AND "'.$todate.'"');
				}
				if(!empty($type)){
					$data->where(['spc.id'=>$type]);
				}
				$data=$data->orderby('tblorders.id','DESC')
				->groupBy('tblorders.id')
				 ->get()
				->getResultArray();
---
SELECT `tblorders`.*, `pa`.`title`, `pa`.`currency`, `c`.`name` as `category`, `ci`.`name` as `city`, `gpa`.`image_name`, `u`.`first_name`, `u`.`last_name`, `spc`.`name` as `membership`
FROM `tblorders`
LEFT JOIN `post_ads` `pa` ON `pa`.`id`=`tblorders`.`product_id`
LEFT JOIN `categories` `c` ON `c`.`id`=`pa`.`category_id`
LEFT JOIN `cities` `ci` ON `ci`.`id`=`pa`.`city_list`
LEFT JOIN `gallerypost_ads` `gpa` ON `pa`.`id`=`gpa`.`post_id`
LEFT JOIN `users` `u` ON `tblorders`.`user_id`=`u`.`id`
LEFT JOIN `subscription_plans` `spl` ON `spl`.`id`=`pa`.`ad_plan_id`
LEFT JOIN `subscription_category` `spc` ON `spc`.`id`=`spl`.`plan_id`
WHERE `pa`.`seller_id` = '6'
GROUP BY `tblorders`.`id`
ORDER BY `tblorders`.`id` DESC

	public function get_allsellerordersamt($userid,$fromdate,$todate,$type){

		$data=$this->db->table('tblorders')
				->select('SUM(tblorders.pay_amt) as pay_amt')
				->join('post_ads pa','pa.id=tblorders.product_id','LEFT')
				->join('users u','tblorders.user_id=u.id','LEFT')
				->join('subscription_plans spl','spl.id=pa.ad_plan_id','LEFT')
				->join('subscription_category spc','spc.id=spl.plan_id','LEFT')
				->where(['pa.seller_id'=>$userid]);

				if(!empty($fromdate) && !empty($todate)){
					$data->where('DATE_FORMAT(FROM_UNIXTIME(tblorders.order_at),"%Y-%m-%d") BETWEEN "'.$fromdate.'" AND "'.$todate.'"');
				}
				if(!empty($type)){
					$data->where(['spc.id'=>$type]);
				}
				$data=$data->orderby('tblorders.id','DESC')
				->groupBy('tblorders.id')
				 ->get()
				->getRowArray();
---
SELECT SUM(tblorders.pay_amt) as pay_amt
FROM `tblorders`
LEFT JOIN `post_ads` `pa` ON `pa`.`id`=`tblorders`.`product_id`
LEFT JOIN `users` `u` ON `tblorders`.`user_id`=`u`.`id`
LEFT JOIN `subscription_plans` `spl` ON `spl`.`id`=`pa`.`ad_plan_id`
LEFT JOIN `subscription_category` `spc` ON `spc`.`id`=`spl`.`plan_id`
WHERE `pa`.`seller_id` = '6'
GROUP BY `tblorders`.`id`
ORDER BY `tblorders`.`id` DESC