app/Models/PostAdsModel.php

    public function get_highlight_post()
    {
        $today = date('Y-m-d');
        $data = $this->db->table('post_ads')
            ->select('post_ads.*,tbl_countries.name AS country_name,tbl_states.name AS state_name,cities.name AS city_name')
            ->join('subscription_plans', 'post_ads.ad_plan_id = subscription_plans.id', 'LEFT')
            ->join('subscription_category', 'subscription_category.id = subscription_plans.plan_id', 'LEFT')
            ->join('tbl_countries', 'tbl_countries.id = post_ads.country_list')
            ->join('tbl_states', 'tbl_states.id = post_ads.state_list')
            ->join('cities', 'cities.id = post_ads.city_list')
            ->where('subscription_category.id = 2')
            ->where('post_ads.ads_time <=', $today)
            ->where('post_ads.ads_end_datetime >=', $today)
            ->where('post_ads.status', 'active')
            ->get();
---
SELECT `post_ads`.*, `tbl_countries`.`name` AS `country_name`, `tbl_states`.`name` AS `state_name`, `cities`.`name` AS `city_name`
FROM `post_ads`
LEFT JOIN `subscription_plans` ON `post_ads`.`ad_plan_id` = `subscription_plans`.`id`
LEFT JOIN `subscription_category` ON `subscription_category`.`id` = `subscription_plans`.`plan_id`
JOIN `tbl_countries` ON `tbl_countries`.`id` = `post_ads`.`country_list`
JOIN `tbl_states` ON `tbl_states`.`id` = `post_ads`.`state_list`
JOIN `cities` ON `cities`.`id` = `post_ads`.`city_list`
WHERE `subscription_category`.`id` = 2
AND `post_ads`.`ads_time` <= '2023-03-17'
AND `post_ads`.`ads_end_datetime` >= '2023-03-17'
AND `post_ads`.`status` = 'active'

    public function get_random_post()
    {

        $today = date('Y-m-d');
        $data = $this->db->table('post_ads')
            ->select('post_ads.*,tbl_countries.name AS country_name,tbl_states.name AS state_name,cities.name AS city_name')

            ->join('subscription_plans', 'post_ads.ad_plan_id = subscription_plans.id', 'LEFT')
            ->join('subscription_category', 'subscription_category.id = subscription_plans.plan_id', 'LEFT')
            ->join('tbl_countries', 'tbl_countries.id = post_ads.country_list')
            ->join('tbl_states', 'tbl_states.id = post_ads.state_list')
            ->join('cities', 'cities.id = post_ads.city_list')
            ->where('subscription_category.id != 2')
            ->where('post_ads.ads_time <=', $today)
            ->where('post_ads.ads_end_datetime >=', $today)
            ->where('post_ads.status', 'active')
            ->orderBy('rand()')
            ->limit('9')
            ->get();
---
SELECT `post_ads`.*, `tbl_countries`.`name` AS `country_name`, `tbl_states`.`name` AS `state_name`, `cities`.`name` AS `city_name`
FROM `post_ads`
LEFT JOIN `subscription_plans` ON `post_ads`.`ad_plan_id` = `subscription_plans`.`id`
LEFT JOIN `subscription_category` ON `subscription_category`.`id` = `subscription_plans`.`plan_id`
JOIN `tbl_countries` ON `tbl_countries`.`id` = `post_ads`.`country_list`
JOIN `tbl_states` ON `tbl_states`.`id` = `post_ads`.`state_list`
JOIN `cities` ON `cities`.`id` = `post_ads`.`city_list`
WHERE `subscription_category`.`id` != 2
AND `post_ads`.`ads_time` <= '2023-03-17'
AND `post_ads`.`ads_end_datetime` >= '2023-03-17'
AND `post_ads`.`status` = 'active'
ORDER BY rand()
 LIMIT 9

    public function getproducts($userid, $searchText)
    {
        $data = $this->db->table('post_ads pa')
            ->select('pa.*,c.name as category,ci.name as city,gpa.image_name')
            ->join('categories c', 'c.id=pa.category_id', 'LEFT')
            ->join('cities ci', 'ci.id=pa.city_list', 'LEFT')
            ->join('gallerypost_ads gpa', 'pa.id=gpa.post_id', 'LEFT')
            ->where(['pa.seller_id' => $userid]);

        if (!empty($searchText)) {
            $data->where('pa.title LIKE "%' . $searchText . '%"');
        }
        $data = $data->orderby('pa.id', 'DESC')
            ->groupBy('pa.id')
            ->get()
            ->getResultArray();
---
SELECT `pa`.*, `c`.`name` as `category`, `ci`.`name` as `city`, `gpa`.`image_name`
FROM `post_ads` `pa`
LEFT JOIN `categories` `c` ON `c`.`id`=`pa`.`category_id`
LEFT JOIN `cities` `ci` ON `ci`.`id`=`pa`.`city_list`
LEFT JOIN `gallerypost_ads` `gpa` ON `pa`.`id`=`gpa`.`post_id`
WHERE `pa`.`seller_id` = '6'
AND `pa`.`title` LIKE "%test%"
GROUP BY `pa`.`id`
ORDER BY `pa`.`id` DESC

    public function getplans()
    {
        $plans = $this->db->table('subscription_category')->get()->getResultArray();
---
SELECT *
FROM `subscription_category`

    public function getmembership($userid, $searchText)
    {
        $data = $this->db->table('post_ads pa')
            ->select('pa.*,c.name as category,ci.name as city,gpa.image_name,spc.name as membership,spl.duration as sduration,spl.amount as samount')
            ->join('categories c', 'c.id=pa.category_id', 'LEFT')
            ->join('cities ci', 'ci.id=pa.city_list', 'LEFT')
            ->join('gallerypost_ads gpa', 'pa.id=gpa.post_id', 'LEFT')
            ->join('subscription_plans spl', 'spl.id=pa.ad_plan_id', 'LEFT')
            ->join('subscription_category spc', 'spc.id=spl.plan_id', 'LEFT')
            ->where(['pa.seller_id' => $userid]);
---
SELECT `pa`.*, `c`.`name` as `category`, `ci`.`name` as `city`, `gpa`.`image_name`, `spc`.`name` as `membership`, `spl`.`duration` as `sduration`, `spl`.`amount` as `samount`
FROM `post_ads` `pa`
LEFT JOIN `categories` `c` ON `c`.`id`=`pa`.`category_id`
LEFT JOIN `cities` `ci` ON `ci`.`id`=`pa`.`city_list`
LEFT JOIN `gallerypost_ads` `gpa` ON `pa`.`id`=`gpa`.`post_id`
LEFT JOIN `subscription_plans` `spl` ON `spl`.`id`=`pa`.`ad_plan_id`
LEFT JOIN `subscription_category` `spc` ON `spc`.`id`=`spl`.`plan_id`
WHERE `pa`.`seller_id` = '6'
GROUP BY `pa`.`id`
ORDER BY `pa`.`id` DESC